# CannotCreateCurtainPanelCorruption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CannotCreateCurtainPanelCorruption Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Can't create Curtain Panel. A Panel or a Mullion is probably too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateCurtainPanelCorruption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateCurtainPanelCorruption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateCurtainPanelCorruption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace